Documents/ПутевойЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПутевойЛист</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаРасходаТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказаниеСпидометра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСписанияПоГСМВАО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Конец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутОткуда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутКуда</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КилометражМаршрута</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПредоставленныеЧеки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаЧека</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧека</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоГСМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЧекаПоГСМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПутевойЛист/Ext/ObjectModule.bsl
Процедура СинхронизироватьДатуДокументаСМаршрутами(Отказ)
	
	МаксДата = Неопределено;
	Для Каждого СтрокаТЧ Из ЭтотОбъект.Показания Цикл
		Если МаксДата = Неопределено Тогда
			МаксДата = СтрокаТЧ.Дата;
			Продолжить;
		КонецЕсли;
		Если СтрокаТЧ.Дата > МаксДата Тогда
			МаксДата = СтрокаТЧ.Дата;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ МаксДата = Неопределено Тогда
		Если НЕ НачалоДня(ЭтотОбъект.Дата) = МаксДата Тогда
			Сообщить("Дата документа не совпадает с максимальной датой в маршрутах!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДублиДат(Отказ)
	
	ВремТаблица = ЭтотОбъект.Показания.Выгрузить(, "НомерСтроки, Дата");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВремТаблица"			, ВремТаблица);
	Запрос.УстановитьПараметр("ТекДокумент"			, ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ФизЛицо"				, ЭтотОбъект.ФизЛицо);   
	Запрос.УстановитьПараметр("ТранспортноеСредство", ЭтотОбъект.ТранспортноеСредство);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВремТаблица.НомерСтроки КАК НомерСтроки,
	|	ВремТаблица.Дата КАК Дата
	|ПОМЕСТИТЬ ВТПоказания
	|ИЗ
	|	&ВремТаблица КАК ВремТаблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПутевойЛистПоказания.НомерСтроки КАК НомерСтроки,
	|	ПутевойЛистПоказания1.Ссылка,
	|	ПутевойЛистПоказания1.НомерСтроки КАК НомерСтроки1,
	|	ПутевойЛистПоказания1.Ссылка.Номер КАК Номер,
	|	ПутевойЛистПоказания1.Ссылка.Дата КАК Дата1
	|ИЗ
	|	ВТПоказания КАК ПутевойЛистПоказания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПутевойЛист.Показания КАК ПутевойЛистПоказания1
	|		ПО (ПутевойЛистПоказания1.Ссылка.ФизЛицо = &ФизЛицо)
	|			И (ПутевойЛистПоказания1.Ссылка.ТранспортноеСредство = &ТранспортноеСредство)
	|			И (ПутевойЛистПоказания1.Дата = ПутевойЛистПоказания.Дата)
	|			И (НЕ ПутевойЛистПоказания1.Ссылка = &ТекДокумент)
	|ГДЕ
	|	НЕ ПутевойЛистПоказания1.Ссылка ЕСТЬ NULL ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В строке №" + Выборка.НомерСтроки + " введена неверная дата, так как она уже введена в путевом листе №" +
							Выборка.Номер + " от " + Формат(Выборка.Дата1, "ДФ=dd.MM.yy");
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//
	ДатаЗапретаРедактирования = Константы.ДатаГраницаРедактированияПЛ.Получить();
	Если ДатаЗапретаРедактирования >= НачалоДня(ЭтотОбъект.Дата) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Период редактирования закрыт!(" + Формат(ДатаЗапретаРедактирования, "ДФ=dd.MM.yyyy") + ")";
		Сообщение.Сообщить();
		Отказ = Истина;	
		Возврат;
	КонецЕсли;
	
	//
	СинхронизироватьДатуДокументаСМаршрутами(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//
	ПроверитьДублиДат(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	//Для каждого ТекСтрока Из ЭтотОбъект.Показания Цикл
	//
	//	Запрос = Новый Запрос;
	//	Запрос.УстановитьПараметр("Ссылка"				, ЭтотОбъект.Ссылка);
	//	Запрос.УстановитьПараметр("Дата"				, ТекСтрока.Дата);
	//	Запрос.УстановитьПараметр("ФизЛицо"				, ЭтотОбъект.ФизЛицо);   
	//	Запрос.УстановитьПараметр("ТранспортноеСредство", ЭтотОбъект.ТранспортноеСредство);
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПутевойЛистПоказания1.Ссылка,
	//	|	ПутевойЛистПоказания1.НомерСтроки КАК НомерСтроки1,
	//	|	ПутевойЛистПоказания1.Ссылка.Номер,
	//	|	ПутевойЛистПоказания1.Ссылка.Дата КАК Дата1
	//	|ИЗ
	//	|	Документ.ПутевойЛист.Показания КАК ПутевойЛистПоказания1
	//	|ГДЕ
	//	|	ПутевойЛистПоказания1.Дата = &Дата
	//	|	И ПутевойЛистПоказания1.Ссылка.ФизЛицо = &ФизЛицо
	//	|	И ПутевойЛистПоказания1.Ссылка.ТранспортноеСредство = &ТранспортноеСредство
	//	|	И ПутевойЛистПоказания1.Ссылка <> &Ссылка";
	//	
	//	Результат = Запрос.Выполнить();
	//	
	//	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	//	
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//		
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "В строке №" + ТекСтрока.НомерСтроки + " введена неверная дата, так как она уже введена в путевом листе №" +
	//							ВыборкаДетальныеЗаписи.Номер + " от " + Формат(ВыборкаДетальныеЗаписи.Дата1, "ДФ=dd.MM.yy");
	//		Сообщение.Сообщить();
	//		Отказ = Истина;
	//		
	//	КонецЦикла;
	//	
	//КонецЦикла;

	ЭтотОбъект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры
